---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointClouds.PointIterator
source: html/c6685363-78b2-b964-3bb2-60066d6124f9.htm
---
# PointIterator Methods

Completes lifetime of the iterator. Call it when done using the iterator.